import { Component, OnInit } from '@angular/core';
import { Router } from '@angular/router';
import { NgxSpinnerService } from 'ngx-spinner';
import { UserFormsValuesDto } from 'src/app/rafiqaneh-common/models/UserFormsValuesDto';
import { FormBuilderService } from 'src/app/rafiqaneh-common/services/form-builder.service';
import { UserService } from 'src/app/rafiqaneh-common/services/user.service';

@Component({
  selector: 'app-certificate-planet',
  templateUrl: './certificate-planet.component.html',
  styleUrls: ['./certificate-planet.component.scss'],
})
export class CertificatePlanetComponent implements OnInit {
  firstName = 'نام کاربر';
  lastName = 'نام خانوادگی کاربر';

  id1 :string='pk1'
  id2 :string='ak2'
//holland
  hollandpersonalityType: string = '';
  hollandpersonalityDescription: string = '';
  hollandpersonalityProperties: string[] = [];

  hollandPercents: number[]=[] ;
  hollandnames: string[]=[] ;
  hollandPercentsReady: boolean = false;

  hollandfinalResults = [
    {
        hollandpersonalityType: 'واقع‌گرا',
      formName: 'holland-vagheh-gara',
      hollandpersonalityDescription: `
      از خصوصیات افرادی که در این طبقه قرار می‌گیرند، می‌توان جدیت در کار، واقع‌بینی در امور، مهارت‌های مکانیکی، تفکر عملی، قدرت جسمانی، علاقه و هماهنگی در کارها را نام برد. فرد واقع‌بین، چنانچه با مشکلی مواجه شود، راه‌حل‌های عملی برای مشکلات جستجو می‌کند. این افراد بیشتر به مشاغلی که نیازمند مهارت‌های فنی است، روی می‌آورند. این افراد علاقمند به کار با وسایل و ماشین‌ها و بی‌علاقه به فعالیت‌های آموزشی و درمانی هستند. از نظر صفات شخصیتی، این افراد اهل عمل، خودمحور، صرفه‌جو، سرسخت و غیراجتماعی هستند. مشاغل مناسب این افراد عبارتند از مشاغل فنی، کشاورزی و بعضی از مشاغل خدماتی؛  `,

      hollandpersonalityProperties: [
        'مهندسی مکانیک',
        'مهندس ماشین‌آلات سنگین',
        'خلبان',
        'تکنسین (در هر رشته‌ای)',
        'تعمیرات و تأسیسات (در هر رشته‌ای)',
        'جوشکار',
        'تراشکار',
        'افسر ارتش',
        'فعالیت در حوزه تربیت بدنی',
        'جنگل‌داری',
        'مشاغل ایمنی تجهیزات',
        'مبلمان‌سازی',
        'ساخت و تعمیر ابزار آلات موسیقی',
        'قالب‌سازی',
        'و به طور کلی هر نوع شغلی که در ارتباط با اشیاء و ابزار باشد و جنبۀ فنی و تکنیکی داشته باشد.'
      ]
    },
    {
        hollandpersonalityType: 'جستجوگر',
      formName: 'holland-jostojo-gara',
      hollandpersonalityDescription: `
    از خصوصیات بارز افراد با امتیاز بالا تفکر، سازمان‌دهی، قدرت و استدلال است. این طبقه از افراد روابط اجتماعی را زیاد دوست ندارند. گاه به رویاپردازی در مورد پیشرفت‌های آینده‌ی خود مبادرت می‌ورزند و از انجام مشاغل پیچیده که نیاز به تفکر دارد، لذت می‌برند. این افراد خلاق، مستقل، پیشرونده، کمرو و محتاط می‌باشند. علاقمند به پژوهش و کارهای علمی در زمینه‌های ریاضی، فیزیک، شیمی، زیست‌شناسی و بی‌علاقه به فعالیت‌های متهورانه(جسورانه و پر ریسک) هستند.
    `,
      hollandpersonalityProperties: [
        'پزشک',
        'فیزیکدان',
        'جراح',
        'شیمیدان',
        'دندانپزشک',
        'ریاضی‌دان',
        'داروساز',
        'کارشناس علوم و فنون هسته‌ای',
        'مهندسی هوا و فضا',
        'اقتصاددان',
        'مهندس طراح سیستم',
        'دامپزشک',
        'زمین‌شناس',
        'زیست‌شناس',
        'نویسنده علمی',
        'جامعه‌شناس',
        'منجم',
        'مهندس (عمران، الکترونیک، کشاورزی و …)',
        'پژوهشگر',
        'روانپزشک',
        'روانشناس',
        'استاد دانشگاه',
        'بیولوژیست',
        'جغرافی‌دان',
        'وبه طور کلی هر نوع شغلی که به داده ها بپردازد و مستلزم پژوهش و تحقیق مداوم باشد.'
      ]
    },
    {
        hollandpersonalityType: 'اجتماعی',
      formName: 'holland-ejtemayee',
      hollandpersonalityDescription: `
    و به طور کلی هر نوع شغلی که در ارتباط با مردم است و آموزش، تدریس و رفاه اجتماعی را مدنظر دارد.
    `,

      hollandpersonalityProperties: [
        'معلم',
        'مدیر مدرسه',
        'مربی الهیات و علوم دینی',
        'مربی تربیتی',
        'جامعه‌شناس',
        'روانشناس',
        'مشاور خانواده',
        'مدیر مهدکودک',
        'کارشناس / مدیر کتابداری',
        'کارشناس / مدیر بخش آموزش',
        'مربی مهدکودک',
        'فیزیوتراپیست',
        'روانکاو',
        'مدیر سازمان‌های خیریه',
        'استاد دانشگاه',
        'پرستار',
        'مورخ',
        'مدیر کارگزینی',
        'رئیس پلیس',
        'کارشناس مطالعات خانواده',
        'روانشناس صنعتی',
        'مشاور تحصیلی',
        'مشاور شغلی',
        'کارشناس روابط عمومی',
        'مددکار اجتماعی',
        'کاردان بهداشت دهان و دندان',
        'افسر پلیس',
        'مأمور آگاهی',
      ]
    },
    {
        hollandpersonalityType: 'قراردادی',
      formName: 'holland-gharardadi',
      hollandpersonalityDescription: `
     این عده احترام خاصی برای حفظ قوانین و مقررات قایل‌اند و به خوبی به کنترل خویش قادر می‌باشند. دوستدار نظم و ترتیب بوده و از موقعیت‌های پیچیده گریزانند و به فعالیت‌های جسمانی تن در نمی‌دهند. به امور دفتری، تنظیم اطلاعات نوشتاری و پردازش داده‌ها علاقمندبوده و به بی‌نظمی و امور هنری علاقمند نیستند.       `,
      hollandpersonalityProperties: [
        'معلم',
        'مدیر مدرسه',
        'مربی الهیات و علوم دینی',
        'مربی تربیتی',
        'جامعه‌شناس',
        'روانشناس',
        'مشاور خانواده',
        'مدیر مهدکودک',
        'کارشناس / مدیر کتابداری',
        'کارشناس / مدیر بخش آموزش',
        'مربی مهدکودک',
        'فیزیوتراپیست',
        'روانکاو',
        'مدیر سازمان‌های خیریه',
        'استاد دانشگاه',
        'پرستار',
        'مورخ',
        'مدیر کارگزینی',
        'رئیس پلیس',
        'کارشناس مطالعات خانواده',
        'روانشناس صنعتی',
        'مشاور تحصیلی',
        'مشاور شغلی',
        'کارشناس روابط عمومی',
        'مددکار اجتماعی',
        'کاردان بهداشت دهان و دندان',
        'افسر پلیس',
        'مأمور آگاهی',
        ' وبه طور کلی هر نوع مشاغلی که توجه و دقت به جزئیات و ریزه کاری در داده ها بپردازد.'
      ]
    },
    {
        hollandpersonalityType: 'جسور',
      formName: 'holland-jasoor',
      hollandpersonalityDescription: `
    افراد نوع تهوری در گویایی بسیار مهارت دارند. ماجراجو و اجتماعی هستند. در فعالیت‌هایشان نقش غالبی بر عهده دارند. در جستجوی قدرت و موقعیت بوده و همواره می‌کوشند تا رهبر باشند و در امور مالی و تجاری نظایر آنها مهارت کسب می‌کنند. علاقمندی به فعالیت‌های رهبری، مدیریت، سیاسی و کسب درآمد اقتصادی و بی‌علاقه به امور پژوهشی هستند.       `,
      hollandpersonalityProperties: [
        'مدیر بازرگانی',
        'بازاریاب',
        'رهبری',
        'مدیر هتل و رستوران',
        'کارشناس حقوق و علوم قضایی',
        'دادستان',
        'قاضی',
        'مدیر امور جهانگردی',
        'خرده فروش',
        'رئیس دانشگاه',
        'مترجم',
        'کارآگاه خصوصی',
        'مشاور املاک',
        'مشاور مالی و سهام',
        'تاجر',
        'سیاستمدار',
        'واسطه‌گر',
        'مدیر منابع انسانی',
        'مدیر دولتی',
        'مدیر اجرایی',
        'نماینده مجلس',
        'مشاور مدیریت',
        'مدیر شرکت خصوصی',
        'مهماندار هواپیما',
        'رئیس اتاق بازرگانی',
        'سرپرست آموزش',
        'حسابدار مالیاتی',
        'بازرس بهداشت محیط کار',
        'مدیر بانک',
        'مدیر شرکت بیمه',
        'مدیر خدمات مجالس و مهمانی‌ها',
        'مأمور خرید',
        'مأمور فروش',
        'وکیل',
        'کارشناس علوم سیاسی',
        'کارشناس روابط بین‌الملل',
        'مدیر فرودگاه',
        'مهندس صنایع',
        'و به طور کلی هر نوع مشاغلی که در ارتباط با مردم است و اهداف سازماندهی، مدیریت و فروشندگی را دارا می باشد.'
      ]
    },
    {
        hollandpersonalityType: 'هنری',
      formName: 'holland-honari',
      hollandpersonalityDescription: `
     افراد این طبقه در شناسایی و بیان خصوصیات خود مهارت دارند. روابط حسنه‌ای با دیگران برقرار نموده و در عین حال از نظم و ترتیب به دوراند. در روابط خود با دیگران حساس‌اند. کمتر به کنترل خود می‌پردازند و به سادگی در مورد عواطف و احساسات خود گفتگو می‌کنند. این عده به صفات زنانه بیش از صفات مردانه گرایش دارند و به مبارزه با مشکلات محیطی از طریق ارایه‌ی آثار هنری اقدام می‌نمایند. نسبت به انجام فعالیت‌های پیچیده و ابتکاری و هنری علاقمند هستند.  `,
      hollandpersonalityProperties: [
        'معماری',
        'طراح تبلیغات',
        'فیلمنامه‌نویس',
        'خوشنویس',
        'شاعر',
        'بازیگر',
        'خبرنگار، روزنامه‌نگار',
        'کارشناس میراث فرهنگی',
        'داستان‌نویس',
        'فیلمبردار',
        'نوازنده',
        'مردم‌شناس',
        'باستان‌شناس',
        'کارشناس علوم ارتباطات',
        'مشاغل مربوط به هنرهای تجسمی، تزئینی و نمایشی',
        'سردبیر مجله و روزنامه',
        'طراح گرافیک',
        'طراح لباس و مد',
        'طراح صحنه',
        'طراح داخلی',
        'انیماتور',
        'ویراستار',
        'طراح صنعتی',
        'طراح پارچه',
        'کارشناس صنایع دستی',
        'گرافیست رایانه‌ای',
        'مترجم زبان‌های خارجی',
        'نویسنده',
        'روانشناس اجتماعی',
        'کارشناس ادبیات فارسی',
        'کارشناس ادبیات زبان‌های خارجی',
        'موسیقیدان / آهنگساز',
        'کارگردان',
        'نقاش',
        'عکاس',
        'کارشناس چاپ',
        'کارشناس مرمت و احیای آثار باستانی',
        'کارشناس فرش',
        'به طور کلی هر نوع مشاغلی که در ارتباط با داده ها و اشیاء باشد و جنبۀ خلاقیت و ابتکار و آثار هنری فرد را ارج نهد و به نوعی با طراحی و دیزاین در ارتباط است.'
      ]
    }
  ]
  hollandresultsName = [
    {
      formName: 'holland-vagheh-gara',
     title: 'واقع گرا',
        
    },
    {
      formName: 'holland-jostojo-gara',
     title: 'جستوجوگر',
        
    },
    {
      formName: 'holland-honari',
     title: 'هنری',
        
    },
    {
      formName: 'holland-ejtemayee',
     title: 'اجتماعی',
        
    },
    {
      formName: 'holland-jasoor',
     title: 'جسور',
        
    },
    {
      formName: 'holland-gharardadi',
     title: 'قراردادی',
        
    },
  
  ];
  //mbti
  quizResultName: string = 'شخصیت ';
  mbtipersonalityType: string = '';
  mbtijobGoodForYou: string = '';
  mbtipersonality: string = '';
  mbtipersonalityDescription: string = '';
  mbtipersonalityProperties: string[] = [];
  positiveThings: string = '';
  negativeThings: string = '';
  mbtiPercents: number[]=[] ;
  mbtiPercentsReady: boolean = false;

  mbtifinalResults: {
    mbtipersonalityType: string;
    mbtijobGoodForYou: string;
    mbtipersonality: string;
    mbtipersonalityDescription: string;
    mbtipersonalityProperties: string[];
    positiveThings: string;
    negativeThings: string;
  }[] = [
    {
      mbtipersonalityType: 'درون‌گرا – حسی – منطقی – قضاوتی',
      mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ISTJ) یا بازرس',
      mbtipersonality: 'ISTJ',
      mbtipersonalityDescription: `
      افراد دارای این تیپ شخصیتی عموماً انسان‌هایی جدی و رسمی به نظر می‌رسند. آن‌ها معمولاً به سنت‌ها علاقه‌ی زیادی دارند و به ارزش‌هایی مانند رعایت احترام، سخت‌کوشی و پذیرش مسئولیت اجتماعی اعتقاد دارند. آن‌ها معمولاً افرادی محافظه‌کار، آرام، ساکت ولی با پشتکار فراوان هستند. در محل کار، آن‌ها به مسئولیت‌پذیری و قابل اعتماد بودن شناخته می‌شوند. این افراد در یک محل کار سازمان‌یافته به سرعت رشد می‌کنند و ترجیح می‌دهند که برای انجام تمام وظایف کاریشان قوانین مدون و روشنی وضع شود. آن‌ها به تفکر تحلیلی و انتقادی گرایش زیادی دارند و به جزئیات نیز علاقه‌ی زیادی دارند. افراد دارای این تیپ شخصیتی انسان‌هایی منطقی هستند و تصمیمات تکانشی را دوست ندارند. این افراد برای مشاغل کارمندی گزینه‌ای عالی محسوب می‌شوند زیرا همان‌طور که گفته شد افرادی قابل اعتماد، هدف‌گرا و تیزبین هستند. این افراد همچنین برای اقتدار و سلسله‌مراتب اداری احترام زیادی قائل‌اند و انتظار دارند کارشان به آن‌ها احساس امنیت و ثبات بدهد.
      `,
      positiveThings: 'نقاط قوت: متعهد، رفتار محافظه‌کارانه در مسائل مالی، انتقادپذیر',
      negativeThings: 'نقاط ضعف: مشغله‌ی فکری زیاد، بی‌احساس، بیش از حد ساختاریافته',
      mbtipersonalityProperties: [
        'دندان‌پزشک',
        'حسابدار',
        'مدیر زنجیره تأمین کالا',
        'تحلیلگر کسب و کار',
        'مشاغل نظامی',
        'مشاور حقوقی',
        'پزشکی',
        'بازرسی (از هر نوع)',
        'مدیریت مالی',
        'تحلیل داده',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – شهودی – احساسی – قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (INFJ) یا حامی',
        mbtipersonality: 'INFJ',
        mbtipersonalityDescription: `
        این افراد معمولاً انسان‌هایی ایدئالیست هستند که نگاه عمیقی به جهان دارند. آن‌ها معمولاً به هیچ پدیده‌ای نگاه سطحی ندارند یا چیزها را همان‌طور که هستند نمی‌پذیرند. آن‌ها اغلب مملو از ایده‌های مختلف و تخیل خلاقی هستند. وقتی صحبت از مشاغل به میان می‌آید، آن‌ها عاشق محیط‌های کاری آرام و بدون تنش هستند و به عنوان متفکرانی عمیق شناخته می‌شوند که از چالش‌های کاری استقبال می‌کنند. آن‌ها همدل و دلسوز هستند و سعی می‌کنند برای دیگران افرادی مفید باشند.
        در واقع این تیپ شخصیتی بسیار نادر است و فقط ۱٪ جمعیت جهان در غالب این تیپ شخصیتی قرار می‌گیرند. این افراد به شدت به دیگران اهمیت می‌دهند، اما با وجود قوه‌ی تخیل قوی یک رؤیاپرداز محسوب نمی‌شوند. آن‌ها با اقدامات عملی خود سعی دارند تا جهان را به مکان بهتری تبدیل کنند.        
      `,
      positiveThings: 'نقاط قوت: دقیق، قاطع، متمرکز، حساس، خوش برخورد',
      negativeThings: 'نقاط ضعف: ولخرج، تفکر و تخیل بیش از حد، درگیری‌های درونی',
      mbtipersonalityProperties: [
        'مشاور',
        'نویسنده',
        'دانشمند',
        'کتابدار',
        'روانشناس',
        'مشاور',
        'مدیر منابع انسانی',
        'نویسندگی/ ویرایش',
        'علوم مربوط به محیط زیست',
        'آموزش و پرورش ویژه',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – شهودی – منطقی – قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (INTJ) یا معمار',
        mbtipersonality: 'INTJ',
        mbtipersonalityDescription: `
        افرادی که در این گروه قرار می‌گیرند، معمولاً انسان‌هایی آرام و محافظ کار هستند که از تنهایی لذت می‌برند. معاشرت با دیگران اغلب انرژی این افراد را از بین می‌برد و در نتیجه نیاز به خلوت کردن و تنهایی برای شارژ مجدد خودشان پیدا می‌کنند. آن‌ها به ایده‌ها و نظریه‌های مختلف علاقه‌مند هستند و دوست دارند از ساز و کار همه چیز سر در بیاورند. آن‌ها در برنامه‌ریزی و تدوین استراتژی مهارت زیادی دارند و از عدم قطعیت خوششان نمی‌آید. این گروه همچنین استعدادی زیادی در تشخیص ارتباط بین مسائل مختلف دارند که این مسئله توان حل مشکل را در آن‌ها بالا می‌برد. آن‌ها همچنین هم در تفکر شهودی و هم تفکر عملی مهارت زیادی دارند. در واقع این افراد دارای خلاقیت زیادی هستید اما بیشتر روی جزئیات تمرکز دارند و معمولاً دوست دارند به تنهایی کار کنند. آن‌ها همیشه در تلاش برای بهبود سیستم‌ها، فرایندها و هر چیز دیگری هستند که در مسیر کاری خود پیدا می‌کنند.
      `,
      positiveThings: 'نقاط قوت: مطمئن،شنوده‌ی خوب، خوش مشرب، باهوش',
      negativeThings: 'نقاط ضعف: سرشار از مشغله‌های فکری، بی احساس، کم عاطفه',
      mbtipersonalityProperties: [
        'نوازنده',
        'سردبیر نشریات',
        'عکاس',
        'مشاور مالی',
        'مدیر بازاریابی',
        'معلم',
        'فیزیوتراپیست',
        'مدیریت پروژه',
        'مهندسی سیستم',
        'تحلیل سیستم',
        'مهندسی نرم‌افزار',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – شهودی – احساسی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (INFP) یا میانجی',
        mbtipersonality: 'INFP',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی INFP معمولاً افرادی ساکت هستند و ترجیح می‌دهند که در مورد خودشان صحبت نکنند. آن‌ها از گذراندن وقتشان به تنهایی و در مکان‌های آرام لذت می‌برند. این افراد عاشق تجزیه و تحلیل علائم و نشانه‌ها هستند و از گم شدن در تخیلات و رؤیاهای خود لذت می‌برند. در محیط‌های حرفه‌ای، INFPها به دنبال یادگیری چیزهای جدید و تغییر جهان هستند. در حالی که آن‌ها معمولاً برای انجام پروژه‌ها در دیگران شور و اشتیاق ایجاد می‌کنند، اما غالباً در مورد حفظ هیجان و انگیزه‌ی خود در طولانی مدت با چالش مواجه می‌شوند. این افراد همچنین اگرچه بسیار باهوش و دارای ذهنیتی باز هستند، اما از درس و مدرسه بدشان می‌آید و حتی از تصور انجام کارهای روتین برای طولانی مدت بیزارند. به همین دلیل است که مسائل روتین در مورد این افراد جوابگو نیست و آن‌ها با رفتارهای روتین مثل سر وقت بیدار شدن یا به موقع به محل کار رفتن همیشه مشکل دارند.
      `,
      positiveThings: 'نقاط قوت: باانگیزه، انعطاف‌پذیر، وفادارحامی، درک بالا، خوش مشرب',
      negativeThings: 'نقاط ضعف: احساسی، رویکرد بیش از حد انتقادی، خجالتی، تعارضات درونی بی‌پایان',
      mbtipersonalityProperties: [
        'کپی‌رایتر',
        'مدیریت منابع انسانی',
        'فیزیوتراپیست',
        'متخصص سلامت روان',
        'هنرمند',
        'عکاس',
        'نویسندگی',
        'نوازنده',
        'هنرهای تجسمی',
        'ماساژ درمانی',
        'مددکار اجتماعی',
        'مدیریت موزه',
        'آسیب‌شناسی گفتار و زبان',
        'طراح مد',
        'طراحی گرافیکی',
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – حسی – احساسی – قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ESFJ) یا سفیر',
        mbtipersonality: 'ESFJ',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ESFJ بسیار اجتماعی هستند و یاز دارند که همیشه با دیگران تعامل داشته باشند و مردم را خوشحال کنند. آن‌ها معمولاً در تمام زندگی خود در کانون توجه جمع قرار می‌گیرند و از سازماندهی رویدادهای اجتماعی برای دوستان و خانواده‌ی خود لذت می‌برند. از آنجا این افراد همیشه به دنبال ایجاد همکاری و هماهنگی در محل کار خود هستند، به طور کلی به دنبال مشاغلی هستند که به آن‌ها اجازه دهد نظم اجتماعی را اعمال کنند. آن‌ها معمولاً به نیازهای دیگران حساس هستند و در خواندن نشانه‌های اجتماعی مهارت زیادی دارند. این افراد همچنین بسیار وفادار و منظم هستند و به هر قیمتی از درگیری با دیگران اجتناب می‌کنند. ویژگی خوب دیگر این افراد این است که هیچ وقت از زیر انجام وظایف کاری خود فرار نمی‌کنند.
      `,
      positiveThings: 'نقاط قوت: رفتاری دوستانه، مدیریت مالی خوب، سخت‌کوش، علاقه‌مند به سنت‌ها',
      negativeThings: 'نقاط ضعف: از تغییرات ناراحت می‌شوند، سوءاستفاده‌گر، خود را فدا می‌کنند، دارای تعارضات درونی',
      mbtipersonalityProperties: [
        'مدیر دفتر',
        'متخصص پشتیبانی فنی',
        'سرپرست موزه',
        'روانشناس',
        'محقق پزشکی',
        'برنامه‌ریزی رویدادهای اجتماعی',
        'پرستاری',
        'حقوقدان',
        'مسئول پذیرش',
        'امور پذیرایی'
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – شهودی – احساسی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ENFP) یا پیکارگر',
        mbtipersonality: 'ENFP',
        mbtipersonalityDescription: `
        افراد دارای این تیپ شخصیتی رفتاری بسیار فردگرایانه دارند. این افراد همیشه در جهت ایجاد ظاهر دلخواه خود، روش‌های فردی خود، اقدامات فردی خود و عادات و ایده‌های خودشان تلاش می‌کنند. آن‌ها دوست ندارند کسی آن‌ها را مجبور کند که در چهارچوبی بسته زندگی کنند. آن‌ها دارای یک ماهیت شهودی قوی هستند و دوست دارند در کنار دیگران باشند و با دیگران تعامل داشته باشند. آن‌ها دارای درک بسیار بالایی هستند و بیشتر اوقات بر اساس احساسات خود عمل می‌کنند. آن‌ها اغلب اوقات به محیط‌های کاری روتین و معمولی‌تر جذب می‌شوند. انگیزه آن‌ها بیشتر به واسطه‌ی اهدافی است که دنبال می‌کنند تا اینکه در انجام کارهایشان صرفاً به دنبال پول باشند. این افراد دارای یک روح رها و آزاد هستند که آن‌ها را تبدیل به فردی جذاب، مستقل و پرانرژی می‌کند. آن‌ها همچنین از تعامل با دیگران و کاوش در میان ایده‌های جدید لذت می‌برند که این مسئله در همه ابعاد مختلف زندگی‌شان نمود دارد. این افراد همچنین به خاطر اینکه همه چیز را جالب می‌دانند، معمولاً در انتخاب مسیر شغلی خود اغلب اوقات با مشکلاتی مواجه می‌شوند.
      `,
      positiveThings: 'نقاط قوت: با محبت، صریح، سرگرم‌کننده، الهام‌بخش، وفادار، درک بالا',
      negativeThings: 'نقاط ضعف: به راحتی خسته می‌شوند، حساس، تعارضات درونی، غیرواقع‌گرا',
      mbtipersonalityProperties: [
        'گزارشگر یا مجری خبر',
        'ویرایشگر',
        'نوازنده',
        'مدیر تولید',
        'معلم دبستان',
        'مربی مهارت‌های زندگی',
        'مددکار اجتماعی',
        'مدیریت فروش',
        'مشاور املاک',
        'امور مشتریان',
        'کارگردانی فیلم',
        'فیلمنامه نویسی',
        'بازاریابی',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – حسی – منطقی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ISTP) یا چیره‌دست',
        mbtipersonality: 'ISTP',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ISTP عموماً افراد اسرارآمیزی هستند که معمولاً منطقی و عقلانی رفتار می‌کنند اما در عین حال می‌توانند افرادی خودجوش و مشتاق نیز باشند. ویژگی‌های شخصیتی آن‌ها به راحتی قابل تشخیص نیست و پیش‌بینی واکنش‌های آن‌ها دشوار است. آن‌ها اغلب افراد غیرقابل پیش‌بینی و خودجوش هستند اما این ویژگی‌های خود را از دیگران پنهان می‌کنند. در زمینه کاری خود نیز در عیب‌یابی و حل مشکلات عملکردی عالی دارند. آن‌ها در حالت عادی افرادی ساکت و محافظ کار هستند اما در مواقع ضروری با دیگران همکاری خوبی دارند. بسیاری از افراد دارای تیپ شخصیتی ISTP، کارهای تحلیلی یا فنی را ترجیح می‌دهند و در صورت بروز مشکلات به سرعت راه‌حلی پیدا می‌کنند. این گروه همچنین افرادی بسیار خلاق هستند که دارای ذهنیت فردگرایانه هستند و برای رسیدن به اهداف خود از انجام هیچ کاری دریغ نمی‌کنند.
      `,
      positiveThings: 'نقاط قوت: دارای اعتماد به نفس، شنونده‌ی خوبی هستند، خوش‌بین، واقع‌بین، با احترام',
      negativeThings: 'نقاط ضعف: دارای ذهنیتی بسته، کم‌حرف، بی‌احساس، کوته‌بین',
      mbtipersonalityProperties: [
        'تکنسین فنی',
        'کارهای ساختمانی',
        'مهندس',
        'پزشکی قانونی',
        'بازرس/ کارآگاه',
        'مکانیک',
        'ورزش/دو و میدانی',
        'سازمان‌های اطلاعاتی',
        'مواد غذایی',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – حسی – منطقی – قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ENFJ) یا قهرمان',
        mbtipersonality: 'ENFJ',
        mbtipersonalityDescription: `
        افرادی که دارای تیپ شخصیتی ENFJ هستند، تمرکز اصلی‌شان معطوف به انسان‌های دیگر است. آن‌ها افرادی برون‌گرا، آرمان‌گرا، دارای چهارچوب اصولی و اخلاقی هستند. آن‌ها می‌دانند چگونه با دیگران ارتباط برقرار کنند و بر شهود و احساساتشان تکیه کنند. هر چند آن‌ها بیشتر در تخیلات خود زندگی می‌کنند تا در دنیای واقعی. افراد دارای این تیپ شخصیتی رهبرانی طبیعی و بسیار با انگیزه هستند اما با این حال به نیازهای اطرافیان خود توجه زیادی دارند. آن‌ها به طور کلی احساس می‌کنند مجبورند دنیا را به مکان بهتری تبدیل کنند.این افراد همچنین دوست دارند به دیگران کمک کنند و در مرکز توجه باشند. آن‌ها دارای ایده‌هایی عالی و یک نظام ارزشی قوی هستند و از دفاع از ارزش‌ها و باورهای خود هیچ هراسی ندارند. افراد این گروه با انرژی خلاق خود و ضمن همکاری با دیگران می‌توانند به اهداف معنی دار خود برسند.
      `,
      positiveThings: 'نقاط قوت: با محبت، صمیمی، دلسوز، شوخ‌طبع، الهام‌بخش، وفادار، توان درک بالا',
      negativeThings: 'نقاط ضعف: دارای ذهنیتی بسته، کنترل‌کننده، انتقادگر، حساس، درگیری‌های درونی بسیار',
      mbtipersonalityProperties: [
        'مشاور',
        'مدیر فروش',
        'مدیر منابع انسانی',
        'کارگردان هنری',
        'مدیر روابط عمومی',
        'تدریس',
        'مشاغل سیاسی',
        'مربی مهارت‌های زندگی',
        'سخنران انگیزشی',
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – حسی – منطقی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ESTP) یا کارآفرین',
        mbtipersonality: 'ESTP',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ESTP نیاز شدیدی به داشتن تعاملات اجتماعی، پردازش منطقی افکارشان، امکان ابراز احساسات و عواطفشان و آزادی دارند. این گروه همچنین افرادی متفکر و منطقی هستند و بر مبنای داده‌ها و الگوهای موجود اقدام به تصمیم‌سازی می‌کنند. آن‌ها به طور طبیعی همیشه به دنبال فرصت‌های جدید هستند و با اشتیاق کارهای خود را دنبال می‌کنند که همین مسئله اغلب آن‌ها را به سمت موفقیت و فرصت‌های کاری بهتر سوق می‌دهد. آن‌ها توان لازم برای کنار آمدن با چالش‌های مختلف را دارند، اما روال عادی به سرعت برای آن‌ها خسته‌کننده می‌شود. این افراد به شدت پرانرژی و هدف‌گرا هستند و از دستاوردهای کوتاه مدت خود انرژی و روحیه می‌گیرند. آن‌ها عاشق اقدام کردن و برنامه‌ریزی‌های روزانه هستند. این گروه رایج‌ترین تیپ شخصیتی است و این افراد به راحتی می‌توانند با دیگران ارتباط برقرار کرده و با آن‌ها تعامل داشته باشند.
      `,
      positiveThings: 'نقاط قوت: جذاب، روشن‌فکر، با اطمینان بالا، مشتاق، سخاوتمند، محبوب، با احساس، شوخ‌طبع',
      negativeThings: 'نقاط ضعف: به راحتی خسته می‌شوند، دارای حساسیت پایین، بی تعهد، بیش از حد سخاوتمند، پرخطر، کوته‌بین، دارای تعارضات درونی',
      mbtipersonalityProperties: [
        'آتش‌نشان',
        'پیراپزشک',
        'کارگردان هنری',
        'مدیر پروژه',
        'مدیر ساخت و ساز',
        'کارآفرینی',
        'مشاغل مدیریتی',
        'مشاغل سیاسی',
        'مشاور املاک',
        'بازیگری',
        'پذیرشگر',
        'مسئول گزارشات',
        'منابع انسانی',
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – حسی – احساسی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ESFP) یا مجری',
        mbtipersonality: 'ESFP',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ESFP عموماً از اینکه مرکز توجه دیگران باشند بیشترین لذت را می‌برند و عاشق تعامل و به اشتراک‌گذاری آموخته‌هایشان با دیگران هستند. آن‌ها افرادی خوش‌مشرب، سخاوتمند، دارای رفتاری دوستانه، سرزنده و سرگرم‌کننده هستند. علاوه بر این، آن‌ها بسیار دلسوز هستند و در هر موقعیتی به فکر رفاه دیگران هستند. اگرچه این افراد از اینکه مرکز توجه دیگران باشند لذت می‌برند، اما از هر شغلی که هیجان‌انگیز و دارای ابعاد متنوع باشد، لذت می‌برند. این افراد در واقع روح و قلب هر مهمانی و رویدادهای اجتماعی هستند. آن‌ها حتی ممکن است بی مقدمه شروع به آواز خواندن بکنند و دوست دارند زمان و انرژی خود را به دیگران اختصاص دهند. هر شغلی که این افراد را از این آزادی باز دارد ۱۰۰٪ آن‌ها را بدبخت می‌کند. چون آن‌ها همیشه به دنبال هیجان، تعامل و فرصتی برای درخشش هستند.
      `,
      positiveThings: 'نقاط قوت: باهوش، خلاق، مشتاق، انعطاف‌پذیر، سخاوتمند، عمل‌گرا، با احساس',
      negativeThings: 'نقاط ضعف: مادی‌گرا، غیر متعهد، بی‌توجه به خود، حساس',
      mbtipersonalityProperties: [
        'برنامه‌ریزی رویدادهای اجتماعی',
        'کارهای مبتنی بر اجرا و نمایش',
        'نماینده فروش',
        'متخصص زیبایی',
        'مهماندار هواپیما',
        'راهنمای تور',
        'مدیریت حراج آثار هنری',
        'برنامه‌ریزی سفر',
        'استندآپ کمدی',
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – حسی – منطقی– قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ شخصیتی (ESTJ) یا مدیر',
        mbtipersonality: 'ESTJ',
        mbtipersonalityDescription: `
        افرادی دارای تیپ شخصیتی ESTJ، افرادی به شدت سازمان‌یافته، فداکار، صادق، باوقار، پایبند به سنت‌ها و معتقد به انجام اموری هستند که احساس می‌کنند به لحاظ اخلاقی درست بوده و از نظر اجتماعی قابل قبول است. آن‌ها اغلب در جمع‌های مختلف نقش‌های رهبری را بر عهده می‌گیرند و مردم هم اغلب برای دریافت راهنمایی و مشاوره به سراغ آن‌ها می‌آیند. آن‌ها دارای رویکردی روشمند، سازمان‌یافته، قابل اعتماد و روشن هستند. آن‌ها در پیروی دقیق از رویه‌های تعیین شده و دستورالعمل‌های کاری عملکردی بسیار خوب دارند. آن‌ها همچنین افرادی فداکار و سخت‌کوش هستند و از همه مهم‌تر هدایت دیگران دقیقاً همین چیزی است که آن‌ها به شدت به آن علاقه‌مندند و در آن استعداد دارند. این افراد یک رهبر واقعی محسوب می‌شوند و برای سنت و نظم احترام زیادی قائل هستند. آن‌ها دارای یک قطب نمای اخلاقی قوی هستند و از هدایت دیگران لذت می‌برند. آن‌ها معمولاً به مشاغلی تمایل دارند که به آن‌ها حس ساختارمندی و سازماندهی می‌دهد، جایی که می‌توانند حس مسئولیت‌پذیری و وفاداری خود را اعمال کنید.
      `,
      positiveThings: 'نقاط قوت: با اطمینان، مشتاق، مدیریت مالی خوب، با مسئولیت، با ثبات',
      negativeThings: 'نقاط ضعف: سرسخت، کنترل‌کننده، بی‌حوصله، بی‌احساس، مادی‌گرا',
      mbtipersonalityProperties: [
        'قاضی',
        'مربی ورزشی',
        'مسئول امور مالی',
        'مدیر هتل',
        'نماینده املاک',
        'مهندسی فروش',
        'ارزیابی اعتبارات',
        'کارگذار بیمه',
        'مشاور املاک',
        'مدیریت شرکتی',
        'مدیریت اجرایی',
        'مدیریت دولتی',
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – شهودی – منطقی – قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ‌ شخصیتی (ENTJ) یا فرمانده',
        mbtipersonality: 'ENTJ',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ENTJ عموماً روی مسائل خارجی تمرکز دارند و با مسائل به شیوه‌ای منطقی و عقلانی برخورد می‌کنند. آن‌ها رهبرانی ذاتی هستند و از حس مسئولیت‌پذیری لذت می‌برند. آن‌ها همچنین چالش‌ها را فرصتی برای انگیزه دادن به خود می‌دانند. افراد دارای این تیپ شخصیتی به سرعت ناکارآمدی‌های موجود را شناسایی کرده و راه حل‌هایی برای مشکلات ارائه می‌دهند. آن‌ها برای تعیین هدف، برنامه‌ریزی و سازماندهی ارزش قائل هستند و از انگیزه و تفکر منطقی خود برای دستیابی به اهدافشان استفاده می‌کنند. این افراد به طور کلی کاریزماتیک و با اعتماد به نفس هستند و می‌توانند دیگران را برای رسیدن به یک هدف مشترک گرد هم جمع کنند. این افراد همچنین به سرعت تصمیم می‌گیرند و به واسطه‌ی پاداش‌های خارجی انگیزه و روحیه می‌گیرند. آن‌ها معمولاً مسئولیت تیم‌های مختلف را بر عهده می‌گیرند و اعتماد به نفس بالایی هم دارند. آن‌ها با تکیه بر اقتدار ذاتی خود سعی می‌کنند تا اطمینان حاصل کنند که تمام اعضای تیم وظایفی را که باید انجام دهد انجام داده و کارها طبق روال پیش می‌رود.
      `,
      positiveThings: 'نقاط قوت: دقیق، با اطمینان، کنجکاو، صریح، مشتاق، واقع‌گرا، قابل اعتماد',
      negativeThings: 'نقاط ضعف: جدال‌برانگیز، بداخلاق، کنترل‌گر، رویکرد بیش از حد انتقادی، بی‌احساس، تهدیدگر',
      mbtipersonalityProperties: [
        'مدیریت کسب و کار',
        'مدیریت روابط عمومی',
        'مهندس مکانیک',
        'قاضی',
        'مدیریت ساخت و ساز',
        'ستاره‌شناس',
        'مدیریت بحران',
        'کارآفرینی',
        'تدوین استراتژی شرکتی',
        'مشاغل سیاسی'
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – شهودی – منطقی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ‌ شخصیتی (INTP) یا متفکر',
        mbtipersonality: 'INTP',
        mbtipersonalityDescription: `
        INTP ها به طور کلی منطقی‌ترین تیپ شخصیتی هستند. آن‌ها عاشق کشف الگوها هستند، سریع متوجه مشکلات می‌شوند و توانایی زیادی در خواندن افکار و احساسات دیگران دارند. این افراد معمولاً به فعالیت‌های روتین روزانه علاقه ندارند اما در عوض از محیط‌هایی که بتوانند خلاقیت خود را در آن نشان دهند لذت می‌برند. آن‌ها عاشق ارائه‌ی راه حل‌های حساب‌شده و بی‌طرفانه برای مشکلات مختلف هستند. در محل کار، افراد دارای تیپ شخصیتی INTP در حل مشکلات و یافتن راه‌حل‌های خلاقانه دارای عملکردی عالی هستند و در هنگام بروز مسائل تجاری در محل کار حضورشان برای تیم بسیار مفید است. آن‌ها معمولاً افرادی خلاق و باهوش هستند که حضورشان در هر تیمی مفید و اثربخش است.
        افراد دارای این تیپ شخصیتی همچنین عاشق تفکر و آزمایش ایده‌های جدید هستند. آن‌ها معمولاً بسیار مستقل هستند و دوست دارند نظریه‌های مختلف خود را تحلیل کنید و از آنجا که عاشق تفکر عمیق هستند، موقعیت‌های شغلی مختلفی را ترجیح می‌دهند که به آن‌ها امکان نوآوری و بروز خلاقیتشان را بدهد.        
      `,
      positiveThings: 'نقاط قوت: با اطمینان، خلاق، مشتاق، آرام، دوست‌داشتنی',
      negativeThings: 'نقاط ضعف: ذهنیت بسته، بی‌احساس، تعارضات درونی، مشکوک',
      mbtipersonalityProperties: [
        'آهنگساز',
        'استاد دانشگاه',
        'نویسنده',
        'تهیه‌کننده',
        'مهندس پزشکی',
        'مشاور بازاریابی',
        'توسعه‌دهنده وب',
        'برنامه‌نویسی کامپیوتر',
        'توسعه نرم‌افزار',
        'تحقیق و پژوهش',
        'تحلیل کسب و کار',
        'تدوین استراتژی شرکتی',
        'نگارش فنی',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – حسی – احساسی – قضاوتی',
        mbtijobGoodForYou: 'شغل مناسب تیپ‌ شخصیتی (ISFJ) یا مدافع',
        mbtipersonality: 'ISFJ',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ISFJ، افراد نیکوکاری هستند که از داشتن رویکردی سخاوتمندانه نسبت به افرادی که با آن‌ها با سخاوت برخورد می‌کنند، لذت می‌برند. آن‌ها برای ایجاد هماهنگی و روحیه همکاری بین دیگران ارزش قائل هستند. این افراد همچنین نسبت به احساسات دیگران حساس هستند و عموماً خونگرم و مهربان هستند. افراد دارای این تیپ شخصیتی دارای اخلاق و روحیه‌ی کاری با ثبات و مستحکمی هستند و وظایف خود را به بهترین نحو به انجام می‌رسانند. آن‌ها کارکنانی وظیفه‌شناس و با انضباط هستند که برای ایجاد و حفظ یک محیط کاری منظم تمام تلاش خود را می‌کنند. این افراد همچنین بسیار کارآمد و مسئولیت‌پذیر هستید اما تمایل زیادی به کمک به دیگران دارند. ویژگی‌های شخصیتی این گروه برای دنیای مدرن ضروری است، چون آن‌ها افرادی به شدت نوع‌دوست و دارای مهارت‌های کاری خوبی هستند، بنابراین معمولاً در خدمت به دیگران است که رضایت و خوشحالی خود را پیدا می‌کنند.
      `,
      positiveThings: 'نقاط قوت: متعهد، رفتار دوستانه، شنونده خوب، سخت‌کوش، سازمان‌یافته، عمل‌گرا',
      negativeThings: 'نقاط ضعف: ذهنیت بسته، روحیه‌ی راکد، درگیری‌های درونی',
      mbtipersonalityProperties: [
        'حسابدار',
        'امور مالی',
        'کارمند بانکی',
        'تحلیلگر',
        'مدیر اداری',
        'عکاس',
        'تدریس',
        'پرستاری',
        'مددکاری اجتماعی',
        'امور مذهبی',
        'خدمات مشتریان',
        'منابع انسانی',
      ],
      },
      {
        mbtipersonalityType: 'برون‌گرا – شهودی – منطقی – ادراکی',
        mbtijobGoodForYou: 'تیپ‌ شخصیتی (ENTP) یا مجادله‌گر',
        mbtipersonality: 'ENTP',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ENTP معمولاً از مکالمات کوتاه با دیگران یا غرق شدن در موقعیت‌های اجتماعی لذت نمی‌برند. آن‌ها افرادی باهوش و آگاه هستند که باید دائماً از نظر ذهنی تحریک شوند. آن‌ها عموماً افرادی منطقی، عقلانی و ریزبین هستند که ترجیح می‌دهند روی ایده‌های بزرگ تمرکز کنند و در برابر انجام کارهای تکراری و روتین همیشه مقاومت کنند. آن‌ها کار مفهومی و حل مسئله را ترجیح می‌دهند، به همین دلیل برای تفکر کارآفرینانه افرادی ایدئال محسوب می‌شوند. کار کردن در سلسله‌مراتب اداری برای این افراد به شدت دشوار است. افراد دارای این تیپ شخصیتی همچنین افرادی جسور، خلاق و دارای رفتاری طعنه‌آمیز هستند که از تلاش و سخت‌کوشی برای رسیدن به اهداف خود نمی‌ترسند. آن‌ها دارای هوش زبانی و ذکاوت بالایی هستند که آن‌ها به گزینه‌ای مناسب برای انجام مناظرات و بحث‌های تحلیلی مختلف تبدیل می‌کند. ویژگی دیگر آن‌ها این است که در محل کار خود، از پیدا کردن راه حل برای مشکلات فنی و فکری لذت می‌برند.
      `,
      positiveThings: 'نقاط قوت: دقت بالا، جذاب، با اطمینان، مشتاق انعطاف‌پذیر، تخیل قوی',
      negativeThings: 'نقاط ضعف: عاشق بحث کردن، بی تعهد، خطرناک، غیرقابل اعتماد',
      mbtipersonalityProperties: [
        'وکیل',
        'کپی رایتر',
        'برنامه‌ریزی مالی',
        'روانشناس',
        'تحلیلگر سیستم',
        'کارگردان هنری',
        'کارشناس عملیات',
        'معاملات سهام',
        'مدیریت فروش',
        'تولید فیلم',
        'روابط عمومی',
        'مشاوره حقوقی',
        'مهندسی',
      ],
      },
      {
        mbtipersonalityType: 'درون‌گرا – حسی – احساسی – ادراکی',
        mbtijobGoodForYou: 'شغل مناسب تیپ‌ شخصیتی (ISFP) یا ماجراجو',
        mbtipersonality: 'ISFP',
        mbtipersonalityDescription: `
        افراد دارای تیپ شخصیتی ISFP، افرادی درون‌گرا هستند که در ظاهراً چندان درون‌گرا نیستند. آن‌ها افرادی خوش‌مشرب با رفتاری صمیمانه و دوستانه هستند، که بودن در کنار آن‌ها برای هر کسی می‌تواند سرگرم‌کننده باشد. آن‌ها می‌خواهند از زندگی‌شان حداکثر بهره ممکن را ببرند و زمان حال را با تمام وجود در آغوش بگیرند. آن‌ها برای ملاقات با افرادی که از کاوش در امور مختلف و کشف تجربیات جدید لذت می‌برند، ارزش و اهمیت زیادی برخوردار هستند. در محل کار، آن‌ها ترجیح می‌دهند طبق برنامه خودشان و بدون دخالت دیگران وظایف و مأموریت‌های کاری خود را انجام دهند. هماهنگی و آرامش برای آن‌ها بسیار مهم است و ترجیح می‌دهند از هر گونه درگیری اجتناب کنند و نظراتشان را عموماً برای خودشان نگه دارند. این افراد همچنین عاشق ماجراجویی و زندگی در لحظه هستند. دیدن زیبایی‌ها و آثار هنری برای آن‌ها بسیار لذت‌بخش و الهام‌بخش است. آن‌ها همچنین اهمیت زیادی به ثروت، قدرت یا امنیت نمی‌دهند و در شغل خود به دنبال آزادی عمل، خلاقیت و فرصتی برای ابراز ابعاد هنرمندانه روح خود هستند.
      `,
      positiveThings: 'نقاط قوت: رفتار محبت‌آمیز، انعطاف‌پذیر، خوش‌بین، عمل‌گرا، با احساس، خوش‌مشرب',
      negativeThings: 'نقاط ضعف: نگرش بدبینانه، نگرش کوته‌بینانه، تعارضات داخلی',
      mbtipersonalityProperties: [
        'حسابدار',
        'مدیریت رسانه‌های اجتماعی',
        'بینایی‌سنجی',
        'دامپزشک',
        'باستان‌شناس',
        'مددکار اجتماعی',
        'کار درمانگر',
        'طراح مد',
        'طراح لوازم‌آرایشی',
        'طراحی گرافیک',
        'نوازندگی',
        'مربی تناسب‌اندام',
        'کارگردان هنری',
        'عکاسی',
      ],
      },]

      mbtiresultsPersonlities = [
        {
          formName: 'mbti-boroon-daroon-gara',
          results: [
            {
              title: 'درون گرا',
              mbtipersonalityType: 'I',
            },
            {
              title: 'برون گرا',
              mbtipersonalityType: 'E',
            },
          ],
        },
        {
          formName: 'mbti-shohodi-hessi',
          results: [
            {
              title: 'شهودی',
              mbtipersonalityType: 'N',
            }, {
              title: 'حسی',
              mbtipersonalityType: 'S',
            },
           
          ],
        },
        {
          formName: 'mbti-ehsasi-manteghi',
          results: [
            {
              title: 'فکری',
              mbtipersonalityType: 'T',
            },
            {
              title: 'احساسی',
              mbtipersonalityType: 'F',
            },
          ],
        },
        {
          formName: 'mbti-ghezavati-edraki',
          results: [
            {
              title: 'منعطف',
              mbtipersonalityType: 'P',
            },
            {
              title: 'منضبط',
              mbtipersonalityType: 'J',
            },
          ],
        },
      ];


      //gardner
      gardnerpersonalityType: string = '';
      gardnerpersonalityDescription: string = '';
      gardnerpersonalityProperties: string[] = [];
    
      gardnerPercents : number[]=[] ;
      // gardnerPercents2 : number[]=[] ;
      gardnerNames : string[]=[] ;
      gardnerPercentsReady: boolean = false;

      gardnerfinalResults: {
        formName: string;
        gardnerpersonalityType: string;
        gardnerpersonalityDescription: string;
        gardnerpersonalityProperties: string[];
      }[] = [
        {
          formName: 'gardner-didari',
          gardnerpersonalityType: 'هوش دیداری-فضایی',
          gardnerpersonalityDescription: `
          هوش فضایی توانایی ذهن در تجسم اشکال، تصاویر، نمودارها، جهت‌یابی‌ها و چنین مواردی را نشان می‌دهد.
          کسانی که دارای هوش تصویری بالایی هستند توانایی تجسمی بالایی دارند و هنرمندان خبره‌ای می‌شوند، و
          معمولا نقاشی‌های شگفت‌انگیزی را طراحی می‌کنند. کسانی که از این استعداد بهره می‌برند در
          جهت‌یابی‌ها، تفسیر تصاویر، فیلم‌ها، نمودارها و نقشه‌ها خوب عمل کنند.
          `,
          gardnerpersonalityProperties: [
            'در تجسم اشکال و تصاویر قوی هستند و می‌توانند هنرمندان توانمندی شوند.',
            'طراحی، ایده‌پردازی، دستکاری تصاویر و فیلم‌ها را به‌خوبی انجام می‌دهند.',
            'نمودارها و اشکال را به‌خوبی تفسیر می‌کنند و می‌توانند اشکال و مجسمه‌های زیبایی بسازند.',
            'در خواندن و نوشتن تبحر دارند و از بازی‌های بصری مثل ساخت پازل لذت می‌برند',
          ],
        },
        {
          formName: 'gardner-reyazi',
          gardnerpersonalityType: 'هوش منطقی – ریاضی',
          gardnerpersonalityDescription: `توانایی بالای افراد در حل مسائل ریاضی مربوط به این حوزه است باید افراد با هوش منطقی و قدرت محاسبات ذهنی بالایی دارند. افراد با این توانایی، می‌توانند مسائل پیچیده و مشکلات را تجزیه‌وتحلیل کرده و ساختارهای محاسباتی و ریاضی را در کمترل زمان حل کنند. افراد دارای هوش منطقی دوست دارند زندگی را با اعداد، الگوها و روابط ریاضی بسنجند و در حل مباحث ریاضی بسیار قوی هستند. `,
          gardnerpersonalityProperties: [
            'به‌راحتی می‌توانند مسائل ریاضی را حل کنند.',
            'توانایی بالایی در انجام آزمایش‌های علمی دارند.',
            'از تفکرات انتزاعی، نمادین و الگوها و استدلال‌های خاص پیروی می‌کنند.',
            'تمام کارهایشان با محاسبه، اندازه‌گیری، درک فرضیه‌ها و حل مشکلات پیش می‌رود.',
            'از انجام بازی‌هایی مثل سودوکو و پیداکردن الگوی شعرها لذت می‌برند. ',
          ],
        },
        {
          formName: 'gardner-kalami',
          gardnerpersonalityType: 'هوش زبانی – کلامی',
          gardnerpersonalityDescription: `هوش زبانی - کلامی توانایی افراد در بیان احساست با نوشتن و صحبت ‌کردن را نشان می‌دهد. افراد در این سخنرانی، خوانندگی و نویسندگی تبحر بالایی دارند و می‌توانند خواسته‌های خود را با چیدن کلمات کنارهم با اعتماد به نفس بالا بیان کنند. افراد با هوش زبانی مفاهیمی مانند معناشناسی، آواشناسی، شناخت قواعد و دستور زبان و کاربرد لغات در شرایط مختلف را دارا هستند.`,
          gardnerpersonalityProperties: [
            'توانایی بالایی در نوشتن و صحبت‌کردن دارند.',
            'می توانند دیگران را متقاعد کنند و در داستان‌سرایی تبحر دارند.',
            'می‌توانند با زبان و گفتار طنز به‌شیوه درست نظر دیگران را جلب کنند.',
            'مسائل پیچیده را به زبانی ساده و شیوا می‌توانند توضیح دهند.',
          ],
        },
        {
          formName: 'gardner-badani',
          gardnerpersonalityType: 'هوش جنبشی – حرکتی',
          gardnerpersonalityDescription: `افزاد دارای هوش جنبشی - حرکتی در انجام حرکات بدنی سخت و سنگین، کنترل و حفظ تعادل جسمانی بسیار توانمند هستند. این افراد در رشته‌های ورزشی عملکرد موفقی دارند. در  کارهای با هماهنگی بالای چشم و دست و فعالیت‌های فیزیکی، استعدادهایشان را نشان می‌دهند.
          `,
          gardnerpersonalityProperties: [
            'در فعالیت‌های فیزیکی مانند ورزش و رقص عملکرد فوق‌العاده‌ای دارند.',
            'وسایلی که با دست ساخته می‌شوند را دوست دارند.',
            'کارها را به‌جای گوش دادن و نوشتن، با انجام دادن یاد می‌گیرند.        ',
          ],
        },
        {
          formName: 'gardner-mosighiyaye',
          gardnerpersonalityType: 'هوش موسیقیایی',
          gardnerpersonalityDescription: `افراد با هوش موسیقیایی درک بالایی در ریتم‌­ها، صداها و الگوهای موسیقی دارند. بسیاری از سازندگان موسیقی و کسانی که در این عرصه فعالیت دارند، از این نوع هوش بهره می‌برند. افراد با این استعداد می‌توانند آلات مختلف موسیقی را به‌خوبی بنوازند و در آوازخوانی، شناسایی الگوی آهنگ‌ها، درک نت‌های موسیقی و به‌خاطر سپردن آنها بسیار توانمند هستند. `,
          gardnerpersonalityProperties: [
            'توانایی بالایی در درک محیط پیرامون و احساسات افراد دارند',
            'به شرایط مختلف از زوایای مختلف نگاه مرده و ان را تجزیه‌وتحلیل می‌کنند.',
            'خیلی سریع اختلافات را رفع می‌کنند و می‌توانند روابط مثبت و سالمی با دیگران برقرار کنند.',
          ],
        },
        {
          formName: 'gardner-meyan-fardi',
          gardnerpersonalityType: 'هوش بین‌فردی',
          gardnerpersonalityDescription: `هوش بین‌فردی درک بالای افراد از محیط پیرامون و مردم و توانایی انجام کارهای گروهی را نشان می‌دهد. افراد دارای این ویژگی به‌راحتی می‌توانند در موقعیت‌های مختلف افراد را درک کرده و با ارزیابی احساسات و انگیزه دیگران، مسائل پیرامون را حل‌وفصل کنند. اگر کسی بدون اینکه احساسات‌تان را بیان کنید عصبانیت یا خوشحالی دیگران درک کند، این شخص از هوش بین‌فردی بالایی برخودار است.`,
          gardnerpersonalityProperties: [
            'در تجسم اشکال و تصاویر قوی هستند و می‌توانند هنرمندان توانمندی شوند.',
            'طراحی، ایده‌پردازی، دستکاری تصاویر و فیلم‌ها را به‌خوبی انجام می‌دهند.',
            'نمودارها و اشکال را به‌خوبی تفسیر می‌کنند و می‌توانند اشکال و مجسمه‌های زیبایی بسازند.',
            'در خواندن و نوشتن تبحر دارند و از بازی‌های بصری مثل ساخت پازل لذت می‌برند',
          ],
        },
        {
          formName: 'gardner-daroon-fardi',
          gardnerpersonalityType: 'هوش درون‌فردی',
          gardnerpersonalityDescription: `توانایی بالای افراد در حل مسائل ریاضی مربوط به این حوزه است باید افراد با هوش منطقی و قدرت محاسبات ذهنی بالایی دارند. افراد با این توانایی، می‌توانند مسائل پیچیده و مشکلات را تجزیه‌وتحلیل کرده و ساختارهای محاسباتی و ریاضی را در کمترل زمان حل کنند. افراد دارای هوش منطقی دوست دارند زندگی را با اعداد، الگوها و روابط ریاضی بسنجند و در حل مباحث ریاضی بسیار قوی هستند. `,
          gardnerpersonalityProperties: [
            'وقت‌شناسی، نظم و مسئولیت‌پذیریی بالایی دارند.',
            'به‌جای صحبت‌کردن، در همدل و شنونده خوبی برای دیگران هستند.',
            'درک درستی از عواطف، احساسات، اهداف و مسیر زندگی خود دارند.',
            'می‌توانند ارتباطات مؤثر و خوبی با دیگران برقرار کنند و در صورت بروز اختلاف  بسیار صلح‌جو هستند.',
          ],
        },
        {
          formName: 'gardner-tabeyat-gara',
          gardnerpersonalityType: 'هوش طبیعت‌گرا',
          gardnerpersonalityDescription: `احتمالاْ شما هم طرفداران محیط زیست را می‌شناسید، این‌ها همان افراد با هوش طبیعت‌گرا هستند که به طبیعت و پرورش موجودات اهمیت زیادی می‌دهند و از انجام‌دادن کارهای مؤثر در طبیعت  لذت می‌برند. گیاه‌شناسی، جانورشناسی، کوهنوردی، صحرانوردی و چادر زدن در طبیعت از علایق افراد با هوش طبیعت‌گرا است.`,
          gardnerpersonalityProperties: [
            'به گیاهان، جانوران و هر آنچه با طبیعت در ارتباط است علاقه دارند.',
            'از باغبانی، پیاده‌روی و کاوش در طبیعت لذت می‌برند.        ',
            'مباحث غیر مرتبط با طبیعت را دوست ندارند.        ',
            'بیشتر اوقات از گیاهان و جانوران نگهداری می‌کنند.        ',
          ],
        },
      ];


      gardnerresultsName = [
        { 
          formName: 'gardner-tabeyat-gara',
          title: 'هوش طبیعت گرا',
          
        },
        {
          formName: 'gardner-meyan-fardi',
          title: 'هوش میان فردی',
          
        },
        {
          formName: 'gardner-badani',
          title: 'هوش بدنی - جنبشی',
          
        },
        {
          formName: 'gardner-daroon-fardi',
          title: 'هوش درون فردی',
          
        },
        {
          formName: 'gardner-kalami',
         title: 'هوش زبانی-کلامی',
            
        },
        {
          formName: 'gardner-reyazi',
         title: 'هوش منطقی - ریاضی',
            
        },
        {
          formName: 'gardner-didari',
         title: 'هوش دیداری - فضایی',
            
        },
        {
          formName:'gardner-mosighiyaye',
         title: 'هوش موسیقیایی',
            
        },
      ]
  constructor(private user: UserService,
              private router: Router,
              private spinner: NgxSpinnerService,
              private formService: FormBuilderService) {
    user.userInfo$.subscribe(
      (s) => (this.firstName = s?.firstName ?? 'نام کاربر')
    );
    user.userInfo$.subscribe(
      (s) => (this.lastName = s?.lastName ?? 'نام خانوادگی کاربر')
    );
  }

  ngOnInit(): void {
    this.getMbtiResult();
    this.getHollandResult();
    this.calculatehollandPersonlity();
    this.getGardnerResult();
    this.calculategardnerPersonlity();
  }

  goBack() {
    this.router.navigate(['/fardamoon/gardner/gardner-missions']);
  }
  goSolarsystem() {
    this.router.navigate(['/fardamoon/solar-system']);
  }


//holland 
getHollandResult() {
  let formNames = ['holland-vagheh-gara', 'holland-jostojo-gara', 'holland-honari', 'holland-ejtemayee', 'holland-jasoor', 'holland-gharardadi'];
  this.spinner.show();
  this.formService.getUserFormsStats(formNames).subscribe({
    next: (result) => {
      // console.log(result);
      this.spinner.hide();
      result.sort((a, b) => a.score - b.score);
      if (result.length > 0) {
        let bestScore = result[result.length - 1].form;
        // console.log('best form: ', bestScore);
        let karname = this.hollandfinalResults.find(s => s.formName == bestScore);
        if (karname != null) {
          this.hollandpersonalityProperties = karname.hollandpersonalityProperties;
          this.hollandpersonalityType = karname.hollandpersonalityType;
          this.hollandpersonalityDescription = karname.hollandpersonalityDescription;
        }
      }


    },
    error: () => {
      this.spinner.hide();
    }
  });
}

calculatehollandPersonlity() {
  let formNames = ['holland-ejtemayee', 'holland-gharardadi', 'holland-honari' ,'holland-jasoor', 'holland-jostojo-gara', 'holland-vagheh-gara' ,];
 
  for (let form of formNames) {
    let fieldName = '';
  
    this.hollandresultsName.find((resultName)=> {resultName.formName === form ? fieldName = resultName.title:''})

    this.hollandnames.push(fieldName)
    // console.log(this.hollandnames)
  }
  this.formService.getUserFormsStats(formNames).subscribe({
    next: (result) => {
      // console.log(result);
      this.spinner.hide();
      result.forEach((r)=> {
        this.hollandPercents.push(Math.round((r.score / 40) *100) );
      })
      this.hollandPercentsReady = true ;

    },
    error: () => {
      this.spinner.hide();
    }
  });
}


  //mbti
  getMbtiResult() {
    let formNames = [
      'mbti-boroon-daroon-gara',
      'mbti-shohodi-hessi',
      'mbti-ehsasi-manteghi',
      'mbti-ghezavati-edraki',
    ];
    this.spinner.show();
    this.formService.getFormsValues(formNames).subscribe({
      next: (result) => {
        this.spinner.hide();
        // console.log(result);
        let mbtipersonality = ''; // eg. ISTJ
        for (let form of formNames) {
          let formResult = result.find((s) => s.form == form);
          if (formResult) {
            mbtipersonality += this.calculateMbtiPersonlity(formResult);
            // mbtipersonality += this.calculateMbtiPersonlity2(formResult);
          }
        }
        console.log('calculated mbtipersonality: ', mbtipersonality);
        let mbtipersonalityDetails = this.mbtifinalResults.find(
          (s) => s.mbtipersonality.toUpperCase() == mbtipersonality
        );
        if (mbtipersonalityDetails) {
          this.mbtipersonalityType = mbtipersonalityDetails.mbtipersonalityType;
          this.mbtijobGoodForYou = mbtipersonalityDetails.mbtijobGoodForYou;
          this.mbtipersonality = mbtipersonalityDetails.mbtipersonality;
          this.mbtipersonalityDescription =
            mbtipersonalityDetails.mbtipersonalityDescription;
          this.mbtipersonalityProperties = mbtipersonalityDetails.mbtipersonalityProperties;
          this.positiveThings = mbtipersonalityDetails.positiveThings;
          this.negativeThings = mbtipersonalityDetails.negativeThings;
        } else console.error('mbtipersonality is not defined in json');
      },
      error: () => {
        this.spinner.hide();
      },
    });
  }

  calculateMbtiPersonlity(form: UserFormsValuesDto) {
    let scoreA = 45;
    let scoreB = 45;
    for (let field of form.fields) {
      if (field.value != null) {
        let s = +field.value - 4;
        scoreA += s;
        scoreB -= s
      }
    }
 
    

    const percentResultA = Math.round((scoreA / 90) *100);
    const percentResultB = Math.round((scoreB / 90) *100);


    this.mbtiPercents.push(percentResultA, percentResultB);
    this.mbtiPercentsReady = true;


    let result = this.mbtiresultsPersonlities.find((s) => s.formName == form.form);
    console.log(this.mbtiPercents)

    
    if (result) {
      if (scoreB > scoreA) {
        return result.results[1].mbtipersonalityType;
      } else {
        return result.results[0].mbtipersonalityType;
      }
    } 

    return '';
  }

  //gardner
  getGardnerResult() {
    let formNames = [
      'gardner-tabeyat-gara',
      'gardner-meyan-fardi',
      'gardner-badani',
      'gardner-daroon-fardi',
      'gardner-kalami',
      'gardner-reyazi',
      'gardner-didari',
      'gardner-mosighiyaye',
    ];
    this.spinner.show();
    this.formService.getUserFormsStats(formNames).subscribe({
      next: (result) => {
        // console.log(result)
        this.spinner.hide();
        result.sort((a, b) => a.score - b.score);
        if (result.length > 0) {
          let bestScore = result[result.length - 1].form;
          // console.log('best form: ', bestScore);
          let karname = this.gardnerfinalResults.find((s) => s.formName == bestScore);
          if (karname != null) {
            this.gardnerpersonalityProperties = karname.gardnerpersonalityProperties;
            this.gardnerpersonalityType = karname.gardnerpersonalityType;
            this.gardnerpersonalityDescription = karname.gardnerpersonalityDescription;
          } else
            console.error('personnel type for formName not defined in json');
        }
      },
      error: () => {
        this.spinner.hide();
      },
    });
  }
  calculategardnerPersonlity() {
    let formNames = [
      'gardner-badani',
      'gardner-daroon-fardi',
      'gardner-didari',
      'gardner-kalami',
      'gardner-meyan-fardi',
      'gardner-mosighiyaye',
      'gardner-reyazi',
      'gardner-tabeyat-gara',
    ];

    for (let form of formNames) {
      let fieldName = '';
     
      this.gardnerresultsName.find((resultName)=> {resultName.formName === form ? fieldName = resultName.title:''})

      // let fieldName:any = personality?.title
      this.gardnerNames.push(fieldName)
      // console.log(this.gardnerNames)
    }

    this.formService.getUserFormsStats(formNames).subscribe({
      next: (result) => {
        // console.log(result);
        this.spinner.hide();
        result.forEach((r)=> {
          this.gardnerPercents.push(Math.round((r.score / 70) *100) );
        })
        this.gardnerPercentsReady = true 

      },
      error: () => {
        this.spinner.hide();
      }
    });
  }
}
